In [2]:
# create data
import pandas as pd
data = pd.DataFrame([{'Name':'girl','Brand':'uniql','Cloth':'sweater','Count':3},
                    {'Name':'girl','Brand':'etam','Cloth':'suit','Count':1},
                    {'Name':'girl','Brand':'etam','Cloth':'pants','Count':1},
                    {'Name':'girl','Brand':'lagogo','Cloth':'jacket','Count':2},
                    {'Name':'boy','Brand':'','Cloth':'pants','Count':2},
                    {'Name':'boy','Brand':'hailan','Cloth':'t-shirt','Count':1},
                    {'Name':'mother','Brand':'hengyuanxiang','Cloth':'coat','Count':2},
                    {'Name':'mother','Brand':'hengyuanxiang','Cloth':'sweater','Count':1},
                    {'Name':'mother','Brand':'','Cloth':'coat','Count':1},
                    {'Name':'father','Brand':'hailan','Cloth':'t-shirt','Count':2},
                    {'Name':'father','Brand':'hailan','Cloth':'sweater','Count':1},
                    {'Name':'father','Brand':'hailan','Cloth':'pants','Count':3}])
data

            Brand    Cloth  Count    Name
0           uniql  sweater      3    girl
1            etam     suit      1    girl
2            etam    pants      1    girl
3          lagogo   jacket      2    girl
4                    pants      2     boy
5          hailan  t-shirt      1     boy
6   hengyuanxiang     coat      2  mother
7   hengyuanxiang  sweater      1  mother
8                     coat      1  mother
9          hailan  t-shirt      2  father
10         hailan  sweater      1  father
11         hailan    pants      3  father

In [5]:
# get columns
print(data.columns)
print(data.columns[0])
print(data.columns[1])

Index(['Brand', 'Cloth', 'Count', 'Name'], dtype='object')
Brand
Cloth

In [6]:
# get index
data.index

RangeIndex(start=0, stop=12, step=1)

In [7]:
# get values
data.values

array([['uniql', 'sweater', 3, 'girl'],
       ['etam', 'suit', 1, 'girl'],
       ['etam', 'pants', 1, 'girl'],
       ['lagogo', 'jacket', 2, 'girl'],
       ['', 'pants', 2, 'boy'],
       ['hailan', 't-shirt', 1, 'boy'],
       ['hengyuanxiang', 'coat', 2, 'mother'],
       ['hengyuanxiang', 'sweater', 1, 'mother'],
       ['', 'coat', 1, 'mother'],
       ['hailan', 't-shirt', 2, 'father'],
       ['hailan', 'sweater', 1, 'father'],
       ['hailan', 'pants', 3, 'father']], dtype=object)

In [13]:
data['Brand'][4]

''

In [14]:
# get a row
data.values[0]

array(['uniql', 'sweater', 3, 'girl'], dtype=object)

In [15]:
# get a grid
data.values[0][3]

'girl'

In [25]:
# groud by key word
print(data)
print('---------------------')
print(data.groupby('Brand'))
gp_brand = data.groupby('Brand')

            Brand    Cloth  Count    Name
0           uniql  sweater      3    girl
1            etam     suit      1    girl
2            etam    pants      1    girl
3          lagogo   jacket      2    girl
4                    pants      2     boy
5          hailan  t-shirt      1     boy
6   hengyuanxiang     coat      2  mother
7   hengyuanxiang  sweater      1  mother
8                     coat      1  mother
9          hailan  t-shirt      2  father
10         hailan  sweater      1  father
11         hailan    pants      3  father
---------------------
<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x0000020A7C2B9BE0>

In [26]:
# count by brand
gp_brand.count()

               Cloth  Count  Name
Brand
                   2      2     2
etam               2      2     2
hailan             4      4     4
hengyuanxiang      2      2     2
lagogo             1      1     1
uniql              1      1     1

In [27]:
# group by brand, so the index is brand
gp_brand.count().index

Index(['', 'etam', 'hailan', 'hengyuanxiang', 'lagogo', 'uniql'], dtype='object', name='Brand')

In [28]:
data

            Brand    Cloth  Count    Name
0           uniql  sweater      3    girl
1            etam     suit      1    girl
2            etam    pants      1    girl
3          lagogo   jacket      2    girl
4                    pants      2     boy
5          hailan  t-shirt      1     boy
6   hengyuanxiang     coat      2  mother
7   hengyuanxiang  sweater      1  mother
8                     coat      1  mother
9          hailan  t-shirt      2  father
10         hailan  sweater      1  father
11         hailan    pants      3  father

In [34]:
# calculate how many person for each brand
# data['Count'] could get a column
# then group it by 'Brand'
# gp1.count() means how many row in one brand, 
# for instance, hailan has 4 rows, so the result for hailan is 4 person
gp1=data['Count'].groupby(data['Brand'])
gp1.count()

Brand
                 2
etam             2
hailan           4
hengyuanxiang    2
lagogo           1
uniql            1
Name: Count, dtype: int64

In [36]:
# get how many clothes for each brand
gp1.agg(sum)

Brand
                 3
etam             2
hailan           7
hengyuanxiang    3
lagogo           2
uniql            3
Name: Count, dtype: int64

In [37]:
# get average of on person for each branch
print(gp1.mean())
# or
print('')
print(gp1.agg(sum) / gp1.count())

Brand
                 1.50
etam             1.00
hailan           1.75
hengyuanxiang    1.50
lagogo           2.00
uniql            3.00
Name: Count, dtype: float64

Brand
                 1.50
etam             1.00
hailan           1.75
hengyuanxiang    1.50
lagogo           2.00
uniql            3.00
Name: Count, dtype: float64

In [39]:
# go through the group by Brand
for name, frame in data.groupby('Brand'):
    print(name)
    print(frame)

  Brand  Cloth  Count    Name
4        pants      2     boy
8         coat      1  mother
etam
  Brand  Cloth  Count  Name
1  etam   suit      1  girl
2  etam  pants      1  girl
hailan
     Brand    Cloth  Count    Name
5   hailan  t-shirt      1     boy
9   hailan  t-shirt      2  father
10  hailan  sweater      1  father
11  hailan    pants      3  father
hengyuanxiang
           Brand    Cloth  Count    Name
6  hengyuanxiang     coat      2  mother
7  hengyuanxiang  sweater      1  mother
lagogo
    Brand   Cloth  Count  Name
3  lagogo  jacket      2  girl
uniql
   Brand    Cloth  Count  Name
0  uniql  sweater      3  girl

In [40]:
# go through the Count group by Brand
for name, frame in data['Count'].groupby(data['Brand']):
    print(name)
    print(frame)

4    2
8    1
Name: Count, dtype: int64
etam
1    1
2    1
Name: Count, dtype: int64
hailan
5     1
9     2
10    1
11    3
Name: Count, dtype: int64
hengyuanxiang
6    2
7    1
Name: Count, dtype: int64
lagogo
3    2
Name: Count, dtype: int64
uniql
0    3
Name: Count, dtype: int64

In [41]:
# sum for each brand
data['Count'].groupby(data['Brand']).agg(sum)

Brand
                 3
etam             2
hailan           7
hengyuanxiang    3
lagogo           2
uniql            3
Name: Count, dtype: int64

In [43]:
# multi group
data.groupby(['Brand', 'Name'])

In [44]:
for name, frame in data.groupby(['Brand', 'Name']):
    print(name)
    print(frame)

('', 'boy')
  Brand  Cloth  Count Name
4        pants      2  boy
('', 'mother')
  Brand Cloth  Count    Name
8        coat      1  mother
('etam', 'girl')
  Brand  Cloth  Count  Name
1  etam   suit      1  girl
2  etam  pants      1  girl
('hailan', 'boy')
    Brand    Cloth  Count Name
5  hailan  t-shirt      1  boy
('hailan', 'father')
     Brand    Cloth  Count    Name
9   hailan  t-shirt      2  father
10  hailan  sweater      1  father
11  hailan    pants      3  father
('hengyuanxiang', 'mother')
           Brand    Cloth  Count    Name
6  hengyuanxiang     coat      2  mother
7  hengyuanxiang  sweater      1  mother
('lagogo', 'girl')
    Brand   Cloth  Count  Name
3  lagogo  jacket      2  girl
('uniql', 'girl')
   Brand    Cloth  Count  Name
0  uniql  sweater      3  girl

In [45]:
data.groupby(['Brand', 'Name']).count()

                      Cloth  Count
Brand         Name
              boy         1      1
              mother      1      1
etam          girl        2      2
hailan        boy         1      1
              father      3      3
hengyuanxiang mother      2      2
lagogo        girl        1      1
uniql         girl        1      1